---
type: RevitLinkInstance
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# RevitLinkInstance

`Autodesk.Revit.DB.RevitLinkInstance` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetLinkDocument | 2014 | `public Document GetLinkDocument ()` |
| Method | MoveBasePointToHostBasePoint | 2016 SubscriptionUpdate | `public void MoveBasePointToHostBasePoint ( bool resetToOriginalRotation )` |
| Method | MoveOriginToHostOrigin | 2016 SubscriptionUpdate | `public void MoveOriginToHostOrigin ( bool resetToOriginalRotation )` |
| Property | Parameter | — | `` |